wurly200a/MidiAppBox/src/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
# Phase 6B: sector 4096 だと VFS 登録の連続ヒープ消費が max_files×4KB 級になり、
# Audio_Init(47KB) と併存できない。MP3 128kbps=16KB/s に対し 512 で十分
CONFIG_FATFS_SECTOR_512=y


# WAMR trimmed to interpreter + libc builtin only.
# LIB_PTHREAD (thread mgr) must stay off: with it enabled,
# wasm_runtime_create_exec_env fails on esp-idf (see CLAUDE.md Phase 1 notes).
CONFIG_WAMR_ENABLE_AOT=n
CONFIG_WAMR_ENABLE_LIB_PTHREAD=n
CONFIG_WAMR_ENABLE_LIBC_WASI=n
CONFIG_WAMR_ENABLE_APP_FRAMEWORK=n

# Phase 12 作業 1: 実フラッシュは 16MB。既定の 2MB / single-app(factory 1MB)では
# ファームウェア領域の残りが約 4KB しかなく、アプリを 1 本足すだけで溢れる。
# partitions.csv は nvs / phy_init / factory のオフセットを既定表と同一に保つ
# (= 既存の NVS 内容は失われない)。factory のみ 1MB -> 4MB へ拡張する。
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
